Билет13/src/Documents/ВыбытиеОборудования/ВыбытиеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыбытиеОборудования</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ОборудованиеВЭксплуатиции</registerRecords>
</mdclass:Document>

Билет13/src/AccumulationRegisters/ОборудованиеВЭксплуатиции/ОборудованиеВЭксплуатиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеВЭксплуатиции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодностиДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокЭксплуатацииДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет13/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодностиДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет13/src/Documents/ВыбытиеОборудования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОборудованиеВЭксплуатиции.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.Записать();
	Движения.ОборудованиеВЭксплуатиции.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	//БлокировкаД
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.УстановитьЗначение("СрокГодностиДо", Новый Диапазон(,Дата));
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать(); 
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОборудованиеВЭксплуатиции");
	ЭлементБлокировки.УстановитьЗначение("СрокГодностиДо", Новый Диапазон(,Дата));
	ЭлементБлокировки.УстановитьЗначение("СрокЭксплуатацииДо", Новый Диапазон(,Дата));
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать(); 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.СрокГодностиДо КАК СрокГодностиДо,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиНоменклатурыОстатки.СебестоимостьОстаток КАК СебестоимостьОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&МоментВремени, СрокГодностиДо < КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)) КАК ОстаткиНоменклатурыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборудованиеВЭксплуатицииОстатки.Номенклатура КАК Номенклатура,
		|	ОборудованиеВЭксплуатицииОстатки.СрокГодностиДо КАК СрокГодностиДо,
		|	ОборудованиеВЭксплуатицииОстатки.СрокЭксплуатацииДо КАК СрокЭксплуатацииДо,
		|	ОборудованиеВЭксплуатицииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОборудованиеВЭксплуатицииОстатки.СебестоимостьОстаток КАК СебестоимостьОстаток
		|ИЗ
		|	РегистрНакопления.ОборудованиеВЭксплуатиции.Остатки(
		|			&МоментВремени,
		|			СрокГодностиДо < КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|				ИЛИ СрокЭксплуатацииДо < КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)) КАК ОборудованиеВЭксплуатицииОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапросаМассив = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапросаМассив[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.СрокГодностиДо = Выборка.СрокГодностиДо ;
		Движение.Количество = Выборка.КоличествоОстаток;
		Движение.Себестоимость = Выборка.СебестоимостьОстаток;
	КонецЦикла;
	Выборка = РезультатЗапросаМассив[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
	 	Движение = Движения.ОборудованиеВЭксплуатиции.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.СрокГодностиДо = Выборка.СрокГодностиДо ;
		Движение.Количество = Выборка.КоличествоОстаток;
		Движение.Себестоимость = Выборка.СебестоимостьОстаток;
		Движение.СрокЭксплуатацииДо = Выборка.СрокЭксплуатацииДо;
	КонецЦикла;
	
КонецПроцедуры
